---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingPlacement
source: html/c741b5b3-d1a6-02ac-7aa3-a210fcf628fa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingPlacement Property

"Apply Nosing Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTrisertypeNosingPlacement { get; }
```